import React from "react";
import {Grid} from "@material-ui/core";
import {useMobileProductStyle} from "./Styles/useMobileProductStyle";
import ProductViewCard from "./ProductViewCard";
import DetailCard from "./DetailCard";
import DescriptionCard from "./DescriptionCard";
import CommentContainer from "./CommentContainer";


function MobileProduct(props) {
    const classes = useMobileProductStyle()
    const product = {
        title: 'آستین کوتاه باله دار خاکستری',
        detail: 'تیشرت دخترانه جنس: یکرو ویسکوز، اسلپ\n' +
            'جنس: ویسکوز\n' +
            'سبک: روزمره\n' +
            'نوع: تیشرت\n' +
            'یقه: یقه گرد\n' +
            'نوع آستین: آستین کوتاه\n' +
            'طرح: ساده\n' +
            'رنگ: خاکستر',
        description: 'مخلوط‌کن مدل HA230 محصولی کاربردی از کالوات (Calwatt) است که با ابعاد جمع‌وجور و وزن پایین طراحی و تولید شده است. این محصول در رنگ‌های متنوعی ارائه شده است تا بتواند نظر افراد با سلیقه‌های متفاوت را به‌خود جلب کند. توان این محصول برابر با 300 وات است و از آن برای تهیه\n' +
            ' انواع اسموتی می‌توان استفاده کرد. ظرفیت بطری این محصول برابر با 570 میلی‌لیتر است. همچنین برای این محصول یک درپوش برای استفاده آسان تراز دستگاه و ریختن آب میوه طراحی شده است. تیغه‌ دستگاه از جنس استیل ضد‌زنگ ساخته شده که کیفیت مطلوبی دارد؛ به این ترتیب می‌توان از آن برای خرد کردن یخ هم استفاده کرد. روی بطری این محصول حلقه‌ای ازجنس سیلیکون قرار گرفته است تا بتوان آن را به‌راحتی در دست گرفت. ظرف این محصول بی‌رنگ است و حالتی شیشه‌ای دارد که می‌توان محتویات داخل آن را مشاهده کرد. موتور این مخلوط‌کن تنها دارای یک سرعت است. گفتنی است این محصول دارای گواهینامه CE است.\n' +
            '\n' +
            'مخلوط کن مدل HA230 با وزن یک کیلوگرم و ابعاد 335 × 85 × 85  میلی‌متر محصولی کاربردی از کالوات (Calwatt) است که با ابعاد جمع و جور و وزن پایین طراحی و تولید شده است.  این مخلوط کن با توجه به، ابعاد مناسب آن، به راحتی داخل کابینت، بدون اشغال کردن فضای زیادی جای می‌گیرد. شایان ذکر است از این مخلوط کن داخل آشپزخانه و روی کابینت هم میتوان بهره برد ، که با توجه به کوچک بودن بعضی از آشپزخانه‌ها بسیار کاربردی است. مخلوط کن مدل HA230  در رنگ‌های متنوعی ارائه شده است تا بتواند طیف وسیعی از سلیقه‌ها را پوشش دهد و با توجه به، رنگ‌بندی سایر وسایل آشپزخانه رنگ مورد علاقه هر فردی انتخاب شود.\n',
        sizes: ['لارج', "ایکس لارج", "دو ایکس لارج", "اسمال"],
        colors: ['زرد', "قرمز", "سبز", "آبی"],
        count: 0,
        hasDiscount: true,
        discount: 0.15,
        price: 2459000,
        priceWithDiscount: 2659000,
    }
    const comments = [
        {
            name: 'آرش دامن‌افشان',
            description: 'مخلوط‌کن مدل HA230 محصولی کاربردی از کالوات (Calwatt) است که با ابعاد جمع‌وجور و وزن پایین طراحی و تولید شده است. این محصول در رنگ‌های متنوعی ارائه شده است تا بتواند نظر افراد با سلیقه‌های متفاوت را به‌خود جلب کند. توان این محصول برابر با 300 وات است و از آن برای تهیه انواع اسموتی می‌توان استفاده کرد. ظرفیت بطری این محصول برابر با 570 میلی‌لیتر است. همچنین برای این محصول یک درپوش برای استفاده آسان تراز دستگاه و ریختن آب میوه طراحی شده است. تیغه‌ دستگاه از جنس استیل ضد‌زنگ ساخته شده که کیفیت مطلوبی دارد؛ به این ترتیب می‌توان از آن برای خرد کردن یخ هم استفاده کرد.'
        },
        {
            name: 'آرش دامن‌افشان',
            description: 'مخلوط‌کن مدل HA230 محصولی کاربردی از کالوات (Calwatt) است که با ابعاد جمع‌وجور و وزن پایین طراحی و تولید شده است. این محصول در رنگ‌های متنوعی ارائه شده است تا بتواند نظر افراد با سلیقه‌های متفاوت را به‌خود جلب کند. توان این محصول برابر با 300 وات است و از آن برای تهیه انواع اسموتی می‌توان استفاده کرد. ظرفیت بطری این محصول برابر با 570 میلی‌لیتر است. همچنین برای این محصول یک درپوش برای استفاده آسان تراز دستگاه و ریختن آب میوه طراحی شده است. تیغه‌ دستگاه از جنس استیل ضد‌زنگ ساخته شده که کیفیت مطلوبی دارد؛ به این ترتیب می‌توان از آن برای خرد کردن یخ هم استفاده کرد.'
        },
        {
            name: 'آرش دامن‌افشان',
            description: 'مخلوط‌کن مدل HA230 محصولی کاربردی از کالوات (Calwatt) است که با ابعاد جمع‌وجور و وزن پایین طراحی و تولید شده است. این محصول در رنگ‌های متنوعی ارائه شده است تا بتواند نظر افراد با سلیقه‌های متفاوت را به‌خود جلب کند. توان این محصول برابر با 300 وات است و از آن برای تهیه انواع اسموتی می‌توان استفاده کرد. ظرفیت بطری این محصول برابر با 570 میلی‌لیتر است. همچنین برای این محصول یک درپوش برای استفاده آسان تراز دستگاه و ریختن آب میوه طراحی شده است. تیغه‌ دستگاه از جنس استیل ضد‌زنگ ساخته شده که کیفیت مطلوبی دارد؛ به این ترتیب می‌توان از آن برای خرد کردن یخ هم استفاده کرد.'
        },
        {
            name: 'آرش دامن‌افشان',
            description: 'مخلوط‌کن مدل HA230 محصولی کاربردی از کالوات (Calwatt) است که با ابعاد جمع‌وجور و وزن پایین طراحی و تولید شده است. این محصول در رنگ‌های متنوعی ارائه شده است تا بتواند نظر افراد با سلیقه‌های متفاوت را به‌خود جلب کند. توان این محصول برابر با 300 وات است و از آن برای تهیه انواع اسموتی می‌توان استفاده کرد. ظرفیت بطری این محصول برابر با 570 میلی‌لیتر است. همچنین برای این محصول یک درپوش برای استفاده آسان تراز دستگاه و ریختن آب میوه طراحی شده است. تیغه‌ دستگاه از جنس استیل ضد‌زنگ ساخته شده که کیفیت مطلوبی دارد؛ به این ترتیب می‌توان از آن برای خرد کردن یخ هم استفاده کرد.'
        },
    ]
    return (
        <Grid container spacing={3}>
            <Grid item xs={12}>
                <ProductViewCard product={product}/>
            </Grid>
            <Grid item xs={12}>
                <DetailCard product={product}/>
            </Grid>
            <Grid item xs={12}>
                <DescriptionCard product={product}/>
            </Grid>
            <Grid item xs={12}>
                <CommentContainer comments={comments}/>
            </Grid>
        </Grid>
    )
}


export default MobileProduct